# Lab 5

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = [{'Name': 'Subodh', 'Marks': 28},
       {'Name': 'Ram', 'Marks': 27},
       {'Name': 'Abdul', 'Marks': 26},
       {'Name': 'John', 'Marks': 28}]
pd.DataFrame(data)

     Name  Marks
0  Subodh     28
1     Ram     27
2   Abdul     26
3    John     28

In [3]:
# Pandas handles missing data with ease
pd.DataFrame([{'Subodh':20, 'Ram':25},{'Abdul':29, 'John':24}], index = ['Mathematics', 'Physics'])

             Subodh   Ram  Abdul  John
Mathematics    20.0  25.0    NaN   NaN
Physics         NaN   NaN   29.0  24.0

In [5]:
#Using dictionary to create a series
car_price_dict = {'Swift': 700000,
                 'Jazz': 800000,
                 'Civic': 1600000,
                 'Altis': 1800000,
                 'Gallardo' : 30000000}
car_price = pd.Series(car_price_dict)
car_man_dict = {'Swift': 'Maruti',
                 'Jazz': 'Honda',
                 'Civic': 'Honda',
                 'Altis': 'Toyota',
                 'Gallardo' : 'Lamborghini'}
car_man = pd.Series(car_man_dict)
cars = pd.DataFrame({'Price': car_price, 'Manufacturer': car_man})
cars

             Price Manufacturer
Swift       700000       Maruti
Jazz        800000        Honda
Civic      1600000        Honda
Altis      1800000       Toyota
Gallardo  30000000  Lamborghini

In [6]:
pd.DataFrame(np.array([[23,25,21,20],[20,25,27,26]]),
            columns = ['Subodh', 'Ram', 'Abdul', 'John'],
            index=['Chemistry', 'English'])

           Subodh  Ram  Abdul  John
Chemistry      23   25     21    20
English        20   25     27    26

In [7]:
data_json = pd.read_json('iris.json',)
data_json

     sepalLength  sepalWidth  petalLength  petalWidth    species
0            5.1         3.5          1.4         0.2     setosa
1            4.9         3.0          1.4         0.2     setosa
2            4.7         3.2          1.3         0.2     setosa
3            4.6         3.1          1.5         0.2     setosa
4            5.0         3.6          1.4         0.2     setosa
..           ...         ...          ...         ...        ...
145          6.7         3.0          5.2         2.3  virginica
146          6.3         2.5          5.0         1.9  virginica
147          6.5         3.0          5.2         2.0  virginica
148          6.2         3.4          5.4         2.3  virginica
149          5.9         3.0          5.1         1.8  virginica

[150 rows x 5 columns]

In [8]:
type(data_json)

pandas.core.frame.DataFrame

In [9]:
data_json.describe() # to include feature whether categorical or numerical df.describe(include='all')

       sepalLength  sepalWidth  petalLength  petalWidth
count   150.000000  150.000000   150.000000  150.000000
mean      5.843333    3.057333     3.758000    1.199333
std       0.828066    0.435866     1.765298    0.762238
min       4.300000    2.000000     1.000000    0.100000
25%       5.100000    2.800000     1.600000    0.300000
50%       5.800000    3.000000     4.350000    1.300000
75%       6.400000    3.300000     5.100000    1.800000
max       7.900000    4.400000     6.900000    2.500000

In [17]:
df = data_json.copy()

In [21]:
df.head()

   sepalLength  sepalWidth  petalLength  petalWidth species
0          5.1         3.5          1.4         0.2  setosa
1          4.9         3.0          1.4         0.2  setosa
2          4.7         3.2          1.3         0.2  setosa
3          4.6         3.1          1.5         0.2  setosa
4          5.0         3.6          1.4         0.2  setosa

In [24]:
df.describe()

       sepalLength  sepalWidth  petalLength  petalWidth
count   150.000000  150.000000   150.000000  150.000000
mean      5.843333    3.057333     3.758000    1.199333
std       0.828066    0.435866     1.765298    0.762238
min       4.300000    2.000000     1.000000    0.100000
25%       5.100000    2.800000     1.600000    0.300000
50%       5.800000    3.000000     4.350000    1.300000
75%       6.400000    3.300000     5.100000    1.800000
max       7.900000    4.400000     6.900000    2.500000

In [25]:
df['species'].value_counts()

species
setosa        50
versicolor    50
virginica     50
Name: count, dtype: int64

In [32]:
df[['species', 'petalLength']].max()

species        virginica
petalLength          6.9
dtype: object

In [33]:
df[df['petalLength']==df['petalLength']].max()

sepalLength          7.9
sepalWidth           4.4
petalLength          6.9
petalWidth           2.5
species        virginica
dtype: object

In [ ]:
# assignment find flower which has max mean petal length and width